Revit 2027 API
BaseExportOptions.SetExportPatternTable Method
 Sets the pattern table to use during export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetExportPatternTable(
	ExportPatternTable patternTable
)
Public Sub SetExportPatternTable (
	patternTable As ExportPatternTable
)
public:
void SetExportPatternTable(
	ExportPatternTable^ patternTable
)
member SetExportPatternTable :
        patternTable : ExportPatternTable -> unit
Parameters
patternTable ExportPatternTable
 The pattern table to be set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BaseExportOptions Class
Autodesk.Revit.DB Namespace